Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: Instances of class :class:`_Feature` have two corresponding methods, :meth:`getOptionalRelease` and :meth:`getMandatoryRelease`.
pl: Przykłady uogólnienia :class:`_Feature` mają dwa odpowiadające sposoby postępowania, :meth:`getOptionalRelease` i :meth:`getMandatoryRelease`.

source: *CompilerFlag* is the (bitfield) flag that should be passed in the fourth argument to the built-in function :func:`compile` to enable the feature in dynamically compiled code. This flag is stored in the :attr:`compiler_flag` attribute on :class:`_Feature` instances.
pl: *CompilerFlag* - Flaga kompilatora (pole bitowe) która powinna być przekazywana w czwartym parametrze do wbudowanego zadania :func:`compile` aby włączyć właściwość w dynamicznie kompilowanym kodzie. Ta flaga jest przechowywana we właściwości :attr:`compiler_flag` w przykładach :class:`_Feature`.

source: No feature description will ever be deleted from :mod:`__future__`. Since its introduction in Python 2.1 the following features have found their way into the language using this mechanism:
pl: Żadne opisy właściwości nie będą nigdy kasowane z :mod:`__future__`. Od momentu jego wprowadzenia w języku pytonowskim w wersji 2.1 następujące właściwości znalazły się jako część języka przy użyciu tego mechanizmu:

source: feature
pl: właściwość

source: optional in
pl: opcjonalna w

source: mandatory in
pl: obowiązuje od

source: effect
pl: efekt

source: nested_scopes
pl: zagnieżdżone_zakresy_widoczności

source: :pep:`227`: *Statically Nested Scopes*
pl: :pep:`227`: *Statycznie zagnieżdżone zakresy widoczności*

source: generators
pl: generatory

source: :pep:`255`: *Simple Generators*
pl: :pep:`255`: *Proste Generatory*

source: division
pl: dzielenie

source: :pep:`238`: *Changing the Division Operator*
pl: :pep:`238`: *Zmiana operatora dzielenia*

source: :pep:`328`: *Imports: Multi-Line and Absolute/Relative*
pl: :pep:`328`: *Importy: Wielo-linijkowe i Bezwzględne/Względne*

source: with_statement
pl: wyrażenie_with

source: :pep:`343`: *The "with" Statement*
pl: :pep:`343`: *polecenie "with"*

source: print_function
pl: zadanie_print

source: :pep:`3105`: *Make print a function*
pl: :pep:`3105`: *Uczynić print zadaniem*

source: unicode_literals
pl: literały_unicode

source: :pep:`3112`: *Bytes literals in Python 3000*
pl: :pep:`3112`: *Kęsowe literały w języku pytonowskim 3000*

source: See also
pl: Zobacz też

source: How the compiler treats future imports.
pl: Jak kompilator traktuje przyszłe importy.

source: :mod:`__main__` --- Top-level script environment
pl: :mod:`__main__` --- środowisko skryptów nadrzędnego poziomu

source: This module represents the (otherwise anonymous) scope in which the interpreter's main program executes --- commands read either from standard input, from a script file, or from an interactive prompt. It is this environment in which the idiomatic "conditional script" stanza causes a script to run::
pl: Ten moduł reprezentuje (zazwyczaj anonimowy) zakres w którym główny program interpretujący polecenia języka pytonowskiego operuje --- polecenia wczytane albo ze standardowego wejścia, z pliku skryptu, lub z współpracującego z użytkownikiem programu zapytań. To jest to środowisko w którym idiomatyczna zwrotka "warunkowego skryptu" powoduje, że skrypt biegnie::

source: :mod:`_dummy_thread` --- Drop-in replacement for the :mod:`_thread` module
pl: :mod:`dummy_thread` --- tymczasowy zamiennik dla modułu :mod:`_thread`

source: This module provides a duplicate interface to the :mod:`_thread` module. It is meant to be imported when the :mod:`_thread` module is not provided on a platform.
pl: Ten moduł dostarcza zduplikowany sprzęg do modułu :mod:`_thread`. Ma on być importowany gdy moduł :mod:`_thread` nie jest dostarczony dla maszyny/środowiska.

source: Suggested usage is::
pl: Sugerowane użycie jest::

source: Be careful to not use this module where deadlock might occur from a thread being created that blocks waiting for another thread to be created. This often occurs with blocking I/O.
pl: Uważaj aby nie używać tego modułu tam gdzie może nastąpić wyścig krytyczny z wątku, który jest tworzony i który blokuje czekając na następny wątek aby został utworzony. To często następuje z zablokowaniem wejścia/wyjścia.

source: :mod:`_thread` --- Low-level threading API
pl: :mod:`_thread` --- Niskiego poziomu sprzęg wątków ( - z ang. - API)

source: This module provides low-level primitives for working with multiple threads (also called :dfn:`light-weight processes` or :dfn:`tasks`) --- multiple threads of control sharing their global data space. For synchronization, simple locks (also called :dfn:`mutexes` or :dfn:`binary semaphores`) are provided. The :mod:`threading` module provides an easier to use and higher-level threading API built on top of this module.
pl: Ten moduł dostarcza niskiego-poziomu figury dla pracy z wieloma wątkami (zwane także :dfn:`niewielkiej-wagi procesy` lub :dfn:`zadania`) --- wiele wątków kontroli wspólnie-dzielących ich nadrzędną przestrzeń danych. Dla synchronizacji, proste blokady (zwane także :dfn:`mutexami` lub :dfn:`binarnymi semaforami`) są dostarczane. Moduł :mod:`threading` dostarcza łatwiejsze w użyciu i wyższego poziomu sprzęgi wątkowe (API) zbudowane na wierzchu ponad tym modułem.

source: The module is optional. It is supported on Windows, Linux, SGI IRIX, Solaris 2.x, as well as on systems that have a POSIX thread (a.k.a. "pthread") implementation. For systems lacking the :mod:`_thread` module, the :mod:`_dummy_thread` module is available. It duplicates this module's interface and can be used as a drop-in replacement.
pl: Ten moduł jest opcjonalny. Jest wspierany w Windows, Linux, SGI IRIX, Solaris 2.x, zarówno jak też na systemach, które mają wypełnienie wątków POSIX-owych (in.zn.j. "pthread"). Dla systemów którym brakuje :mod:`_thread`, moduł :mod:`_dummy_thread` jest dostępny. Duplikuje sprzęg modułu i może być użyty jako tymczasowe zastępstwo.

source: It defines the following constants and functions:
pl: Definiuje następujące stałe i zadania:

source: Raised on thread-specific errors.
pl: Wystawiany podczas szczególnych dla wątku błędów.

source: This is the type of lock objects.
pl: To jest typ przedmiotów blokujących.

source: Start a new thread and return its identifier. The thread executes the function *function* with the argument list *args* (which must be a tuple). The optional *kwargs* argument specifies a dictionary of keyword arguments. When the function returns, the thread silently exits. When the function terminates with an unhandled exception, a stack trace is printed and then the thread exits (but other threads continue to run).
pl: Zacznij nowy wątek i zwróć jego identyfikator. Wątek wykonuje zadanie *function* z listą parametrów *args* (które muszą być krotką). Opcjonalny parametr *kwargs* wyszczególnia słownik parametrów słów kluczowych. Gdy zadanie powraca, wątek milcząco wyłącza się. Gdy zadanie kończy się z nieobsłużonym wyjątkiem, wypis sterty jest drukowany i wtedy wątek kończy się (ale inne wątki pracują dalej).

source: Raise a :exc:`KeyboardInterrupt` exception in the main thread. A subthread can use this function to interrupt the main thread.
pl: Zgłoś wyjątek :exc:`KeyboardInterrupt` w głównym wątku. Wątek podrzędny może używać tego zadania aby przerywać wątek główny.

source: Raise the :exc:`SystemExit` exception. When not caught, this will cause the thread to exit silently.
pl: Zgłoś wyjątek :exc:`SystemExit`. Gdy nie złapany, to spowoduje że wątek wyjdzie po cichu.

source: Return a new lock object. Methods of locks are described below. The lock is initially unlocked.
pl: Zwróć nowy przedmiot blokady. Sposoby postępowania blokad są opisane poniżej. Blokada początkowo jest odblokowana.

source: Return the 'thread identifier' of the current thread. This is a nonzero integer. Its value has no direct meaning; it is intended as a magic cookie to be used e.g. to index a dictionary of thread-specific data. Thread identifiers may be recycled when a thread exits and another thread is created.
pl: Zwróć 'identyfikator wątku' dla obecnego wątku. To jest niezerowa liczba całkowita. Jej wartość nie ma żadnego bezpośredniego znaczenia; jest ona pomyślana jako magiczne ciasteczko do użycia np. aby indeksować słownik szczególnych-dla-wątku danych. Identyfikatory wątku mogą być ponownie użyte gdy wątek kończy a następny wątek jest tworzony.

source: Return the thread stack size used when creating new threads. The optional *size* argument specifies the stack size to be used for subsequently created threads, and must be 0 (use platform or configured default) or a positive integer value of at least 32,768 (32kB). If changing the thread stack size is unsupported, a :exc:`ThreadError` is raised. If the specified stack size is invalid, a :exc:`ValueError` is raised and the stack size is unmodified. 32kB is currently the minimum supported stack size value to guarantee sufficient stack space for the interpreter itself. Note that some platforms may have particular restrictions on values for the stack size, such as requiring a minimum stack size > 32kB or requiring allocation in multiples of the system memory page size - platform documentation should be referred to for more information (4kB pages are common; using multiples of 4096 for the stack size is the suggested approach in the absence of more specific information). Availability: Windows, systems with POSIX threads.
pl: Zwróć rozmiar sterty używany do tworzenia nowych wątków. Opcjonalny parametr *rozmiaru* określa rozmiar sterty do użycia dla później tworzonych wątków, i musi być 0 (używać wartości domyślnej wynikającej z maszyny/środowiska lub konfiguracji) lub dodatniej liczby całkowitej o wartości co najmniej 32,768 (32kB). Jeśli zmiana rozmiaru sterty wątku jest niewspierana, :exc:`ThreadError` jest zgłaszany. Jeśli określony rozmiar sterty jest nieprawidłowy, :exc:`ValueError` jest zgłaszany i rozmiar sterty nie jest modyfikowany. 32kB jest obecnie minimalnym wspieranym rozmiarem sterty gwarantującym wystarczający rozmiar sterty dla programu interpretującego polecenia języka pytonowskiego samego w sobie. Zauważ, że niektóre maszyny/środowiska mogą mieć szczególne ograniczenia na wartości dla rozmiaru sterty, takie jak wymaganie minimalnego rozmiaru sterty > 32kB lub wymaganie umieszczenia w wielokrotności rozmiaru strony pamięci systemu - dokumentacja maszyny/środowiska powinna zostać sprawdzona w celu uzyskania większej ilości informacji na ten temat (strony 4kB są znane; użycie wielokrotności 4096 dla rozmiaru sterty jest sugerowanym podejściem w obliczu braku bardziej szczegółowych informacji). Dostępność: Windows, systemy z wątkami POSIX.

source: The maximum value allowed for the *timeout* parameter of :meth:`Lock.acquire`. Specifiying a timeout greater than this value will raise an :exc:`OverflowError`.
pl: Maksymalna wartość dozwolona dla parametru *timeout* do sposobu postępowania :meth:`Lock.acquire`. Określenie parametru timeout większego niż ta wartość będzie zgłaszać :exc:`OverflowError`.

source: Lock objects have the following methods:
pl: Przedmioty blokad mają następujące sposoby postępowania:

source: Without any optional argument, this method acquires the lock unconditionally, if necessary waiting until it is released by another thread (only one thread at a time can acquire a lock --- that's their reason for existence).
pl: Bez żadnych opcjonalnych argumentów, ta metoda przejmuje blokadę bezwarunkowo, jeśli to konieczne czekając aż zostanie zwolniona przez inny wątek (tylko jeden wątek na raz może przejąć blokadę --- to ich sens istnienia).

source: If the integer *waitflag* argument is present, the action depends on its value: if it is zero, the lock is only acquired if it can be acquired immediately without waiting, while if it is nonzero, the lock is acquired unconditionally as above.
pl: Jeśli całkowita liczba parametr *waitflag* - z ang. - *flagaoczekiwania* - jest obecna, akcja zależy od jej wartości: jeśli jest ona równa zero, blokada jest tylko przejmowana jeśli może być przejęta natychmiast bez czekania, podczas gdy jest ona niezerowa, blokada jest przejmowana bezwarunkowo jak powyżej.

source: If the floating-point *timeout* argument is present and positive, it specifies the maximum wait time in seconds before returning. A negative *timeout* argument specifies an unbounded wait. You cannot specify a *timeout* if *waitflag* is zero.
pl: Jeśli zmienno-przecinkowy *koniecczasu* - z ang. - *timeout* parametr jest obecny i dodatni, określa on maksymalny czas oczekiwania w sekundach przed powrotem. Ujemny parametr *końcaczasu* określa nieograniczone oczekiwanie. Nie możesz określić parametru *końcaczasu* jeśli *flagaoczekiwania* jest zero.

source: The return value is ``True`` if the lock is acquired successfully, ``False`` if not.
pl: Wartość zwracana jest ``Prawdą`` - z ang. - ``True`` jeśli blokada jest przejmowana w udany sposób, ``Fałsz`` - z ang. - ``False`` jeśli nie.

source: Releases the lock. The lock must have been acquired earlier, but not necessarily by the same thread.
pl: Zwalnia blokadę. Blokada musiała być przejęta wcześniej, ale nie koniecznie przez ten sam wątek.

source: Return the status of the lock: ``True`` if it has been acquired by some thread, ``False`` if not.
pl: Zwróć status blokady: ``Prawda`` - z ang. - ``True`` jeśli została przejęta przez jakiś wątek, ``Fałsz`` - z ang. - ``False`` jeśli nie.

source: In addition to these methods, lock objects can also be used via the :keyword:`with` statement, e.g.::
pl: W dodatku do tych sposobów postępowania, przedmioty blokad mogą także być użyte przez polecenie :keyword:`with`, np.::

source: import _thread a_lock = _thread.allocate_lock() with a_lock: print("a_lock is locked while this executes")
pl: import _thread zamek = _thread.allocate_lock() with zamek: print("zamek jest zablokowany podczas gdy to się wykonuje")

source: **Caveats:**
pl: **Zakawyczki:**

source: Threads interact strangely with interrupts: the :exc:`KeyboardInterrupt` exception will be received by an arbitrary thread. (When the :mod:`signal` module is available, interrupts always go to the main thread.)
pl: Wątki oddziałują dziwnie z przerwaniami: wyjątek :exc:`KeyboardInterrupt` zostanie odebrany przez dowolny wątek. (Gdy moduł :mod:`signal` jest dostępny, przerwania zawsze idą do głównego wątku.)

source: Calling :func:`sys.exit` or raising the :exc:`SystemExit` exception is equivalent to calling :func:`_thread.exit`.
pl: Wywołanie :func:`sys.exit` lub zgłoszenie wyjątku :exc:`SystemExit` jest równoważne z wezwaniem zadania :func:`_thread.exit`.

source: Not all built-in functions that may block waiting for I/O allow other threads to run. (The most popular ones (:func:`time.sleep`, :meth:`file.read`, :func:`select.select`) work as expected.)
pl: Nie wszystkie wbudowane zadania które mogą blokować oczekiwanie na wejście/wyjście pozwalają innym wątkom działać. (Najpopularniejsze to (:func:`time.sleep`, :meth:`file.read`, :func:`select.select`) pracują zgodnie z oczekiwaniami.)

source: It is not possible to interrupt the :meth:`acquire` method on a lock --- the :exc:`KeyboardInterrupt` exception will happen after the lock has been acquired.
pl: Nie jest możliwe przerwanie wykonanie :meth:`acquire` na blokadzie --- wyjątek :exc:`KeyboardInterrupt` zdarzy się po tym jak blokada zostanie przejęta.

source: When the main thread exits, it is system defined whether the other threads survive. On most systems, they are killed without executing :keyword:`try` ... :keyword:`finally` clauses or executing object destructors.
pl: Gdy główny wątek wychodzi, jest zdefiniowane przez system czy inne wątki nie zostaną zakończone. W większości systemów, są one kończone bez wykonywania klauzul :keyword:`try` ... :keyword:`finally` lub wykonywania destrukcji przedmiotów.

source: When the main thread exits, it does not do any of its usual cleanup (except that :keyword:`try` ... :keyword:`finally` clauses are honored), and the standard I/O files are not flushed.
pl: Gdy główny wątek kończy się, nie wykonuje on żadnego typowego sprzątania (z wyjątkiem klauzul :keyword:`try` ... :keyword:`finally` które są honorowane), i standardowe pliki wejścia/wyjścia nie są czyszczone.

source: :mod:`abc` --- Abstract Base Classes
pl: moduł :mod:`abc` --- abstrakcyjne podstawowe uogólnienia

source: This module provides the infrastructure for defining an :term:`abstract base class` (ABCs) in Python, as outlined in :pep:`3119`; see the PEP for why this was added to Python. (See also :pep:`3141` and the :mod:`numbers` module regarding a type hierarchy for numbers based on ABCs.)
pl: Ten moduł dostarcza infrastrukturę dla definiowania :term:`abstrakcyjnych podstawowych uogólnień` (ABC-ów) w języku pytonowskim, jak określono w propozycji :pep:`3119`; zobacz PEP dla sprawdzenia co sprawiło że zostało to dodane do języka pytonowskiego. (Zobacz także :pep:`3141` i moduł :mod:`numbers` w odniesieniu do hierarchii typów dla liczb opartych o ABC-e.)

source: The :mod:`collections` module has some concrete classes that derive from ABCs; these can, of course, be further derived. In addition the :mod:`collections` module has some ABCs that can be used to test whether a class or instance provides a particular interface, for example, is it hashable or a mapping.
pl: Moduł :mod:`collections` posiada pewne konkretne uogólnienia które dziedziczą po ABC-ach; te mogą oczywiście być dalej dziedziczone. W dodatku moduł :mod:`collections` ma pewne ABC-e, które mogą być użyte aby sprawdzić czy uogólnienie lub przykład uogólnienia dostarcza szczególny sprzęg dla przykładu, czy jest on mieszany czy jest on mapowany etc.

source: This module provides the following class:
pl: Ten moduł dostarcza następujące uogólnienie:

source: Metaclass for defining Abstract Base Classes (ABCs).
pl: Pośrednie uogólnienie dla definiowania abstrakcyjnych uogólnień podstawowych (w skr. z ang. - ABC - Abstract Base Class).

source: Use this metaclass to create an ABC. An ABC can be subclassed directly, and then acts as a mix-in class. You can also register unrelated concrete classes (even built-in classes) and unrelated ABCs as "virtual subclasses" -- these and their descendants will be considered subclasses of the registering ABC by the built-in :func:`issubclass` function, but the registering ABC won't show up in their MRO (Method Resolution Order) nor will method implementations defined by the registering ABC be callable (not even via :func:`super`). [#]_
pl: Używaj tego uogólnienia pośredniego aby utworzyć abstrakcyjne uogólnienie podstawowe (w skr. z ang. ABC). ABC może być wykorzystane do tworzenia następnych uogólnień bezpośrednio, i wtedy działa jako uogólnienie domieszki. Możesz także zarejestrować niezwiązane uogólnienia konkretne (nawet wbudowane uogólnienia) i niezwiązane abstrakcyjne uogólnienia podstawowe jako "sztuczne podrzędne uogólnienia" -- te uogólnienia i pochodne po nich będą uznawane za podrzędne uogólnienia rejestrowanego uogólnienia podstawowego abstrakcyjnego przez wbudowane zadanie :func:`issubclass`, ale rejestrowanie abstrakcyjnego uogólnienia bazowego nie pokaże się w ich sposobie rozwiązywania sposobów postępowania (w skr. MRO - z ang. - Method Resolution Order) ani też wypełnienia sposobów postępowania określone przez rejestrowanie abstrakcyjnych bazowych uogólnień nie będą wywoływalne (nawet nie przez użycie :func:`super`). [#]_

source: Classes created with a metaclass of :class:`ABCMeta` have the following method:
pl: Uogólnienia stworzone za pomocą pośredniego uogólnienia :class:`ABCMeta` mają następujący sposób postępowania:

source: Register *subclass* as a "virtual subclass" of this ABC. For example::
pl: Zarejestruj *podrzędne uogólnienie* jako "wirtualne podrzędne uogólnienie" tego uogólnienia abstrakcyjnego podstawowego. Na przykład::

source: You can also override this method in an abstract base class:
pl: Możesz także obejść ten sposób postępowania w abstrakcyjnym bazowym uogólnieniu:

source: (Must be defined as a class method.)
pl: (Musi być określona jako sposób postępowania uogólnienia.)

source: Check whether *subclass* is considered a subclass of this ABC. This means that you can customize the behavior of ``issubclass`` further without the need to call :meth:`register` on every class you want to consider a subclass of the ABC. (This class method is called from the :meth:`__subclasscheck__` method of the ABC.)
pl: Sprawdzi czy *podrzędne uogólnienie* jest uważane za podrzędne względem tego abstrakcyjnego uogólnienia bazowego. To oznacza, że możesz dostosować zachowanie ``issubclass``, dalej bez konieczności wzywania sposobu postępowania :meth:`register` w każdym uogólnieniu które chcesz uważać za podrzędne uogólnienie względem tego abstrakcyjnego uogólnienia podstawowego. (Ten sposób postępowania uogólnienia jest wzywany ze sposobu postępowania :meth:`__subclasscheck__` tego abstrakcyjnego uogólnienia podstawowego.)

source: This method should return ``True``, ``False`` or ``NotImplemented``. If it returns ``True``, the *subclass* is considered a subclass of this ABC. If it returns ``False``, the *subclass* is not considered a subclass of this ABC, even if it would normally be one. If it returns ``NotImplemented``, the subclass check is continued with the usual mechanism.
pl: Ten sposób postępowania powinien zwrócić ``Prawdę`` - z ang. - ``True``, ``Fałsz`` - z ang. - ``False`` lub ``niewypełnione`` - z ang. - ``NotImplemented``. Jeśli zwraca ``True``, *podrzędne uogólnienie* jest uważanie za podrzędne względem tego abstrakcyjnego uogólnienia podstawowego. Jeśli zwraca ``Fałsz``, *podrzędne uogólnienie* nie jest uważane za podrzędne względem tego abstrakcyjnego uogólnienia podstawowego, nawet jeśli zwykle byłoby takim. Jeśli zwraca ``NotImplemented``, sprawdzenie podrzędnego uogólnienia jest kontynuowane z typowym mechanizmem.

source: For a demonstration of these concepts, look at this example ABC definition::
pl: Dla demonstracji tych pomysłów, popatrz na tę przykładową definicję abstrakcyjnego uogólnienia podstawowego::

source: The ABC ``MyIterable`` defines the standard iterable method, :meth:`__iter__`, as an abstract method. The implementation given here can still be called from subclasses. The :meth:`get_iterator` method is also part of the ``MyIterable`` abstract base class, but it does not have to be overridden in non-abstract derived classes.
pl: Abstrakcyjne uogólnienie podstawowe ``MyIterable`` określa standardowy iterowalny sposób postępowania, :meth:`__iter__`, jako abstrakcyjny sposób postępowania. Wypełnienie podane tutaj może wciąż być wzywane z podrzędnych uogólnień. Sposób postępowania :meth:`get_iterator` jest także częścią abstrakcyjnego podstawowego uogólnienia ``MyIterable``, ale nie musi być to obchodzone w nie-abstrakcyjnym uogólnieniu pochodnym.

source: The :meth:`__subclasshook__` class method defined here says that any class that has an :meth:`__iter__` method in its :attr:`__dict__` (or in that of one of its base classes, accessed via the :attr:`__mro__` list) is considered a ``MyIterable`` too.
pl: sposób postępowania uogólnienia :meth:`__subclasshook__` mówi, że każde uogólnienie które ma sposób postępowania :meth:`__iter__` w swoim słowniku :attr:`__dict__` (lub w jednym należącym do jego uogólnienia bazowego, dostępnego przez listę :attr:`__mro__`) jest uważane także za ``MyIterable``.
